In [1]:
import requests
import pandas as pd

In [2]:
#create the global df to hold info for all years' tables (columns need to be named the same as the data pulled)
us_rent = pd.DataFrame(columns = ['County', '0 BR', '1 BR', '2 BR', '3 BR', '4 BR', 'Est. Population', 'years']) 
#create a list that has all of the years that I want to extract
years_extract = ['2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019', '2020']

header = {
"User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.75 Safari/537.36",
"X-Requested-With": "XMLHttpRequest"
}

for years in years_extract:
    #create the url that will be used for the request.get
    url = f'https://www.rentdata.org/states/{years}'
    #hit the url/API and store info in a temporary df
    r = requests.get(url, headers=header)
    #temporary data frame created from the html
    temp_dfs = pd.read_html(r.text)[0]
    #taking column named years and appending all info from years to it
    temp_dfs['years'] = years
    #temp df is appended to global df
    us_rent = pd.concat([us_rent, temp_dfs], ignore_index= True)
#iterate

In [3]:
us_rent.columns

Index(['County', '0 BR', '1 BR', '2 BR', '3 BR', '4 BR', 'Est. Population',
       'years', 'State'],
      dtype='object')

In [4]:
us_rent

,County,0 BR,1 BR,2 BR,3 BR,4 BR,Est. Population,years,State
0,NaN,$367,$410,$481,$624,$720,4447100,2006,Alabama (AL)
1,NaN,$637,$751,$941,"$1,238","$1,385",610666,2006,Alaska (AK)
2,NaN,$484,$544,$664,$931,"$1,067",5130632,2006,Arizona (AZ)
3,NaN,$365,$404,$483,$634,$711,2673400,2006,Arkansas (AR)
4,NaN,$620,$709,$876,"$1,234","$1,402",33871648,2006,California (CA)
...,...,...,...,...,...,...,...,...,...
815,NaN,$760,$829,$992,"$1,323","$1,571",0,2020,Virginia (VA)
816,NaN,$745,$845,"$1,069","$1,502","$1,742",0,2020,Washington (WA)
817,NaN,$560,$597,$726,$959,"$1,116",0,2020,West Virginia (WV)
818,NaN,$554,$624,$800,"$1,057","$1,180",0,2020,Wisconsin (WI)
819,NaN,$621,$679,$846,"$1,138","$1,423",0,2020,Wyoming (WY)

In [5]:
us_rent.dtypes

County             object
0 BR               object
1 BR               object
2 BR               object
3 BR               object
4 BR               object
Est. Population    object
years              object
State              object
dtype: object

In [6]:
us_rent['State'] = us_rent['State'].astype('str')

In [7]:
us_rent.head()

,County,0 BR,1 BR,2 BR,3 BR,4 BR,Est. Population,years,State
0,NaN,$367,$410,$481,$624,$720,4447100,2006,Alabama (AL)
1,NaN,$637,$751,$941,"$1,238","$1,385",610666,2006,Alaska (AK)
2,NaN,$484,$544,$664,$931,"$1,067",5130632,2006,Arizona (AZ)
3,NaN,$365,$404,$483,$634,$711,2673400,2006,Arkansas (AR)
4,NaN,$620,$709,$876,"$1,234","$1,402",33871648,2006,California (CA)

In [8]:
us_rent['State'] = us_rent['State'].str.split('(').str[0]

In [9]:
us_rent.head()

  County  0 BR  1 BR  2 BR    3 BR    4 BR Est. Population years        State
0    NaN  $367  $410  $481    $624    $720         4447100  2006     Alabama
1    NaN  $637  $751  $941  $1,238  $1,385          610666  2006      Alaska
2    NaN  $484  $544  $664    $931  $1,067         5130632  2006     Arizona
3    NaN  $365  $404  $483    $634    $711         2673400  2006    Arkansas
4    NaN  $620  $709  $876  $1,234  $1,402        33871648  2006  California

In [ ]:
us_rent['State'] = us_rent['State'].str.split("").str[0]

In [ ]:
us_rent.head()

In [ ]:
url = 'https://www.rentdata.org/states/florida/2006'
header = {
  "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.75 Safari/537.36",
  "X-Requested-With": "XMLHttpRequest"
}
r = requests.get(url, headers=header)
dfs = pd.read_html(r.text)
dfs[1]

In [ ]:
dfs[0]